Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include <ctype.h>
#include "cli_m.h"
#include "nrf_cli.h"
#include "nrf_ble_gatt.h"
#include "nrf_log.h"
#include "ble_m.h"
#include "ble_hci.h"
#include "ble_conn_params.h"
#include "peer_manager.h"
#include "nfc_m.h"
#include "nfc_central_m.h"
#include "adafruit_pn532.h"

#define UNKNOWN_PARAMETER     "unknown parameter: "
#define WRONG_PARAMETER_COUNT "wrong parameter count \n"
#define KEY_PASSKEY_LEN       (6U)

#define UNIT_TO_MSEC(uint, resolution) (uint16_t)(((uint) * (resolution)) / 1000)            /**< Macro for converting ticks into milliseconds. */

#define SEC_PARAM_CENTRAL_DEFAULT                           \
    {                                                       \
        .bond           = 1,                                \
        .mitm           = 0,                                \
        .lesc           = 0,                                \
        .keypress       = 0,                                \
        .io_caps        = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY, \
        .oob            = 0,                                \
        .min_key_size   = BLE_SEC_PARAM_MIN_KEY_SIZE,       \
        .max_key_size   = BLE_SEC_PARAM_MAX_KEY_SIZE,       \
        .kdist_own.enc  = 1,                                \
        .kdist_own.id   = 1,                                \
        .kdist_peer.enc = 1,                                \
        .kdist_peer.id  = 1,                                \
    }

#define APP_BEACON_INFO_LENGTH          0x17                               /**< Total length of information advertised by the Beacon. */
#define APP_ADV_DATA_LENGTH             0x15                               /**< Length of manufacturer specific data in the advertisement. */
#define APP_DEVICE_TYPE                 0x02                               /**< 0x02 refers to Beacon. */
#define APP_MEASURED_RSSI               0xC3                               /**< The Beacon's measured RSSI at 1 meter distance in dBm. */
#define APP_COMPANY_IDENTIFIER          0x0059                             /**< Company identifier for Nordic Semiconductor ASA. as per www.bluetooth.org. */
#define APP_MAJOR_VALUE                 0x01, 0x02                         /**< Major value used to identify Beacons. */
#define APP_MINOR_VALUE                 0x03, 0x04                         /**< Minor value used to identify Beacons. */
#define APP_BEACON_UUID                 0x01, 0x12, 0x23, 0x34, \
                                        0x45, 0x56, 0x67, 0x78, \
                                        0x89, 0x9a, 0xab, 0xbc, \
                                        0xcd, 0xde, 0xef, 0xf0            /**< Proprietary UUID for Beacon. */

typedef union
{
    char connect_addr_cmd_buffer[DEVICE_TO_FIND_MAX][CLI_MAX_CMD_LEN]; /**< Device address from scan buffer. */
    char connected_cmd_buffer[NRF_BLE_LINK_COUNT][CLI_MAX_CMD_LEN];    /**< Connected device address buffer. */
    char bond_cmd_buffer[BOND_DEVICE_MAX][CLI_MAX_CMD_LEN];            /**< Bonded device address buffer. */
    char beacon_uuid_cmd_buffer[1][16];
    char beacon_major_cmd_buffer[1][4];
    char beacon_minor_cmd_buffer[1][4];
    char beacon_txpower_cmd_buffer[1][2];
} cli_cmd_buffer_t;

typedef struct
{
    cli_cmd_buffer_t buffer_type; /**< Dynamic command buffer type. */
    uint8_t          cmd_counter; /**< Dynamic command counter. */
} cli_cmd_connect_addr_t;

typedef struct
{
    cli_cmd_buffer_t  buffer_type;
    uint8_t           cmd_counter;
}cli_cmd_beacon_type_t;


typedef enum
{
    CLI_CMD_CONNECT_ADDR,  /**< Device address from scan. */
    CLI_CMD_CONNECTED,     /**< Connected device address. */
    CLI_CMD_BONDED,        /**< Bonded device address. */
} cli_cmd_buffer_type_t;


bool                   m_key_request_event = false;         /**< Flag informing about a key request event. */
char                   m_device_name[DEVICE_NAME_MAX_SIZE]; /**< Device name. */
uint16_t               m_conn_handle;                       /**< Connection handle for pairing and key request. */
cli_cmd_connect_addr_t m_cli_connect_addr;                  /**< List of BLE address strings for all devices found during scanning using as CLI commands. */
cli_cmd_connect_addr_t m_cli_connected;                     /**< List of connected devices address string using as CLI commands. */
cli_cmd_connect_addr_t m_cli_bonded;                        /**< List of bonded devices address string using as CLI commands. */

cli_cmd_beacon_type_t  m_cli_uuid;
cli_cmd_beacon_type_t  m_cli_major;
cli_cmd_beacon_type_t  m_cli_minor;
cli_cmd_beacon_type_t  m_cli_txpower;

ble_gap_sec_params_t   m_sec_params_central = SEC_PARAM_CENTRAL_DEFAULT;
ble_gap_conn_params_t  m_params_update      =
{
    .min_conn_interval = MIN_CONNECTION_INTERVAL,
    .max_conn_interval = MAX_CONNECTION_INTERVAL,
    .slave_latency     = SLAVE_LATENCY,
    .conn_sup_timeout  = SUPERVISION_TIMEOUT
};


static uint8_t m_beacon_info[APP_BEACON_INFO_LENGTH] =                    /**< Information advertised by the Beacon. */
{
    APP_DEVICE_TYPE,     // Manufacturer specific information. Specifies the device type in this
                         // implementation.
    APP_ADV_DATA_LENGTH, // Manufacturer specific information. Specifies the length of the
                         // manufacturer specific data in this implementation.
    APP_BEACON_UUID,     // 128 bit UUID value.
    APP_MAJOR_VALUE,     // Major arbitrary value that can be used to distinguish between Beacons.
    APP_MINOR_VALUE,     // Minor arbitrary value that can be used to distinguish between Beacons.
    APP_MEASURED_RSSI    // Manufacturer specific information. The Beacon's measured TX power in
                         // this implementation.
};

/**@Function for verification connection handle.
 */
static inline bool conn_handle_is_valid(uint16_t conn_handle, nrf_cli_t const * p_cli)
{
    if (conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Invalid device address\n");
        return false;
    }

