Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
    return true;
}


/**@Function for verification of the error code.
 */
static inline void ret_code_verify(ret_code_t err_code)
{
    if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_INVALID_STATE))
    {
        APP_ERROR_CHECK(err_code);
    }
}


/* Function required by qsort */
static int string_cmp(void const * p_a, void const * p_b)
{
    ASSERT(p_a);
    ASSERT(p_b);
    return strcmp( (char const *)p_a, (char const *)p_b);
}


/**@brief Function for adding BLE address string as command to the dynamic command buffer.
 *
 * @param[in]   p_data           BLE address to remove.
 * @param[in]   p_cli_buffer     Dynamic command buffer.
 * @param[in]   type             Type of the dynamic command buffer.
 */
static void cli_addr_string_to_command_add(uint8_t          const * p_data,
                                           cli_cmd_connect_addr_t * p_cli_buffer,
                                           cli_cmd_buffer_type_t    type)
{
    uint8_t   idx;
    uint8_t   size;
    uint8_t * p_cmd_counter = &p_cli_buffer->cmd_counter;
    char      (*p_buffer)[CLI_MAX_CMD_LEN];

    switch (type)
    {
        case CLI_CMD_CONNECT_ADDR:
            size = DEVICE_TO_FIND_MAX;
            p_buffer = p_cli_buffer->buffer_type.connect_addr_cmd_buffer;
        break;

        case CLI_CMD_CONNECTED:
            size = NRF_BLE_LINK_COUNT;
            p_buffer = p_cli_buffer->buffer_type.connected_cmd_buffer;
        break;

        case CLI_CMD_BONDED:
            size = BOND_DEVICE_MAX;
            p_buffer = p_cli_buffer->buffer_type.bond_cmd_buffer;
        break;

        default:
            return;

    }

    char string_buf[ADDR_STRING_LEN];

    memset(string_buf, 0, ADDR_STRING_LEN);

    // Address conversion to string.
    int_addr_to_hex_str(string_buf, BLE_GAP_ADDR_LEN, p_data);

    // If no place in buffer then return.
    if (*p_cmd_counter >= size)
    {
        return;
    }

    // Check if the address is repeated.
    for (idx = 0; idx < size; idx++)
    {
        if (!strcmp(p_buffer[idx], string_buf))
        {
            return;
        }
    }

    //Add address to buffer.
    sprintf(p_buffer[(*p_cmd_counter)++], "%s", string_buf);
    qsort(p_buffer,
          *p_cmd_counter,
          sizeof(p_buffer[0]),
          string_cmp);
}


/**@brief Function for removing a BLE address string from the dynamic command buffer.
 *
 * @param[in]   p_data           BLE address to remove.
 * @param[in]   p_cli_buffer     Dynamic command buffer.
 * @param[in]   type             Type of the dynamic command buffer.
 */
static void cli_addr_from_command_remove(char             * const p_data,
                                         cli_cmd_connect_addr_t * p_cli_buffer,
                                         cli_cmd_buffer_type_t    type)
{
    uint8_t   size;
    uint8_t * p_cmd_counter = &p_cli_buffer->cmd_counter;
    char      (*p_buffer)[CLI_MAX_CMD_LEN];

    switch (type)
    {
        case CLI_CMD_CONNECT_ADDR:
            size = DEVICE_TO_FIND_MAX;
            p_buffer = p_cli_buffer->buffer_type.connect_addr_cmd_buffer;
        break;

        case CLI_CMD_CONNECTED:
            size = NRF_BLE_LINK_COUNT;
            p_buffer = p_cli_buffer->buffer_type.connected_cmd_buffer;
        break;

        case CLI_CMD_BONDED:
            size = BOND_DEVICE_MAX;
            p_buffer = p_cli_buffer->buffer_type.bond_cmd_buffer;
        break;

        default:
            return;

    }
    for (uint8_t idx = 0; idx < *p_cmd_counter; idx++)
    {
        if (!strcmp(p_buffer[idx], p_data))
        {
            if (idx == size - 1)
            {
                p_buffer[idx][0] = '\0';
            }
            else
            {
                memmove(p_buffer[idx],
                        p_buffer[idx + 1],
                        sizeof(p_buffer[idx]) * (*p_cmd_counter - idx));
            }

            --(*p_cmd_counter);

            return;
        }
    }
}


void connected_to_cmd_add(conn_peer_t * p_connected_peers, uint16_t conn_handle)
{
    ASSERT(p_connected_peers);

    cli_addr_string_to_command_add(p_connected_peers[conn_handle].address.addr,
                                   &m_cli_connected,
                                   CLI_CMD_CONNECTED);
}


void connected_to_cmd_remove(conn_peer_t * p_connected_peers, uint16_t conn_handle)
{
    ASSERT(p_connected_peers);

    char string_addr_buf[ADDR_STRING_LEN];

    // Convert address to format XX:XX:XX:XX:XX:XX.
    int_addr_to_hex_str(string_addr_buf,
                        BLE_GAP_ADDR_LEN,
                        p_connected_peers[conn_handle].address.addr);

    // Remove address from command buffer.
    cli_addr_from_command_remove(string_addr_buf,
                                 &m_cli_connected,
                                 CLI_CMD_CONNECTED);
}


void address_to_cmd_add(ble_gap_addr_t const * p_connected_addr)
{
    ASSERT(p_connected_addr);
    // Add address to command buffer.
    cli_addr_string_to_command_add(p_connected_addr->addr,
                                   &m_cli_connect_addr,
                                   CLI_CMD_CONNECT_ADDR);
}


void connect_addr_clear(void)
{
    /* Erasing the dynamically created command (address, name) and commands counters */
    memset(&m_cli_connect_addr, 0, sizeof(m_cli_connect_addr));
}


void bond_get(void)
{
    ret_code_t   err_code;
    pm_peer_id_t current_peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);

    memset(&m_cli_bonded, 0, sizeof(m_cli_bonded));

    // Reading all peer`s bonding data.
    while (current_peer_id != PM_PEER_ID_INVALID)
    {
        pm_peer_data_bonding_t p_data;

        err_code = pm_peer_data_bonding_load(current_peer_id, &p_data);

        if (err_code == NRF_SUCCESS)
        {
            // Add bonded device address to CLI commands.
            cli_addr_string_to_command_add(p_data.peer_ble_id.id_addr_info.addr,
                                           &m_cli_bonded,
                                           CLI_CMD_BONDED);
        }

