Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
        current_peer_id = pm_next_peer_id_get(current_peer_id);
    }
}


void bonds_delete(void)
{
    ret_code_t err_code;

    // Delete all data stored for all peers.
    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
    memset(&m_cli_bonded, 0, sizeof(m_cli_bonded) );
}


void key_request_set(void)
{
    m_key_request_event = true;
}


/**@brief Function for setting the PHY.
 *
 * @param[in] value            New PHY value.
 * @param[in] conn_handle      The connection handle identifying the connection to perform this procedure on.
 */
static void phy_set(nrf_cli_t const * p_cli, uint8_t value, uint16_t conn_handle)
{
    ble_gap_phys_t phy =
    {
        .rx_phys = value,
        .tx_phys = value,
    };

    // Set new PHY value.
    preferred_phy_set(&phy, conn_handle);
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Preferred PHY set to %s.\n", phy_str(&phy));
}


/**@brief Function for restoring the default connection parameters.
 *
 * @param[out] Pointer to conn_params.
 */
static void default_con_param(ble_gap_conn_params_t * p_params_update)
{
    p_params_update->min_conn_interval = MIN_CONNECTION_INTERVAL;
    p_params_update->max_conn_interval = MAX_CONNECTION_INTERVAL;
    p_params_update->slave_latency     = SLAVE_LATENCY;
    p_params_update->conn_sup_timeout  = SUPERVISION_TIMEOUT;
}


/**@brief Function for printing the connectable devices.
 *
 *@details Function print list of available to connect device address and name (if exist).
 *         Display format: XX:XX:XX:XX:XX:XX device_name .
 *
 * @param[in] p_cli       Pointer to the instance of the command line module.
 * @param[in] device      Pointer to the struct storing the scanned devices.
 */
static void device_list_print(nrf_cli_t const * p_cli, scanned_device_t * p_device)
{
    for (uint8_t i = 0; i < DEVICE_TO_FIND_MAX; i++)
    {
        if (p_device[i].is_not_empty)
        {
            nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Device ");

            char buffer[ADDR_STRING_LEN];
            int_addr_to_hex_str(buffer, BLE_GAP_ADDR_LEN, p_device[i].addr);

            nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "%s %s\n", buffer,  p_device[i].dev_name);
        }
    }
}


/**@brief Function for setting the CCCD Descriptor value.
 *
 * @param[in] p_cli          Instance of the command line.
 * @param[in] cccd           New CCCD value.
 * @param[in] addr           Device address in string format.
 * @param[in] uuid           Characteristic UUID in string format.
 */
static void cccd_set(nrf_cli_t const * p_cli, uint16_t cccd, char * p_addr, char * p_uuid)
{
    uint16_t                 conn_handle;
    uint16_t                 desc_handle;
    ret_code_t               err_code;
    ble_gattc_write_params_t write_params;

    // Search for connection handle.
    conn_handle = addr_string_to_conn_handle(p_addr);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    memset(&write_params, 0, sizeof(write_params));

    desc_handle = cccd_descriptors_handle_get(p_uuid);

    if (desc_handle == BLE_GATT_HANDLE_INVALID)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "Wrong characteristic UUID or the CCCD descriptor has not been found yet\n");
        return;
    }

    uint16_t cccd_val    = cccd;
    uint8_t  data_buf[2] = {LSB_16(cccd_val), MSB_16(cccd_val)};
    uint8_t  data_len    = sizeof(data_buf);

    write_params.write_op = BLE_GATT_OP_WRITE_REQ;
    write_params.handle   = desc_handle;
    write_params.len      = data_len;
    write_params.p_value  = data_buf;
    write_params.offset   = 0;
    write_params.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;

    // Set CCCD descriptor value.
    err_code = sd_ble_gattc_write(conn_handle, &write_params);

    if (err_code != NRF_SUCCESS)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "wrong characteristic UUID or the CCCD descriptor has not been found yet\n");
    }
}


/**@brief Command handler for displaying the connected devices.
 */
static void cmd_connected_display(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    ret_code_t         err_code;
    uint16_t           conn_handle;
    ble_gap_conn_sec_t security_params;
    memset(&security_params, 0, sizeof(security_params));

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Connected devices:\n");

    for (uint8_t i = 0; i < m_cli_connected.cmd_counter; i++)
    {
        conn_handle = addr_string_to_conn_handle(
            m_cli_connected.buffer_type.connected_cmd_buffer[i]);

        // Get connection security level.
        err_code = sd_ble_gap_conn_sec_get(conn_handle, &security_params);

        if (err_code != NRF_SUCCESS)
        {
            nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Security level reading has failed\n");

            return;
        }
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_NORMAL,
                        "%d. %s Security level: %d \n",
                        i,
                        m_cli_connected.buffer_type.connected_cmd_buffer[i],
                        security_params.sec_mode.lv);
    }
}


static void cmd_privacy(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argv);

    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);

}

/** @brief Command handler for setting privacy.
 */
static void cmd_privacy_on(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(p_cli);
    UNUSED_VARIABLE(argc);
    UNUSED_VARIABLE(argv);

    ret_code_t               err_code;
    ble_gap_privacy_params_t privacy_params;

    // Privacy settings cannot be changed while advertising, scanning, or creating a connection.
    scan_stop();
    adv_stop();
    err_code = sd_ble_gap_connect_cancel();
    ret_code_verify(err_code);

    memset(&privacy_params, 0, sizeof(privacy_params));

