Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
    // Privacy setting.
    privacy_params.privacy_mode         = BLE_GAP_PRIVACY_MODE_DEVICE_PRIVACY;
    privacy_params.private_addr_type    = BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE;
    privacy_params.private_addr_cycle_s = PRIVATE_ADDRESS_INTERVAL;
    privacy_params.p_device_irk         = NULL;

    // Set privacy.
    err_code = sd_ble_gap_privacy_set(&privacy_params);
    APP_ERROR_CHECK(err_code);

    // Set device indentities list.
    err_code = sd_ble_gap_device_identities_set(NULL, NULL, NRF_SDH_BLE_PERIPHERAL_LINK_COUNT);
    APP_ERROR_CHECK(err_code);
}

/**@brief Command handler for disabling privacy.
 */
static void cmd_privacy_off(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(p_cli);
    UNUSED_VARIABLE(argc);
    UNUSED_VARIABLE(argv);

    ret_code_t               err_code;
    ble_gap_privacy_params_t privacy_params;

     // Privacy settings cannot be changed while advertising, scanning, or creating a connection. 
    scan_stop();
    adv_stop();

    err_code = sd_ble_gap_connect_cancel();
    ret_code_verify(err_code);

    memset(&privacy_params, 0, sizeof(privacy_params));
    privacy_params.privacy_mode         = BLE_GAP_PRIVACY_MODE_OFF;
    privacy_params.private_addr_type    = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
    privacy_params.private_addr_cycle_s = BLE_GAP_DEFAULT_PRIVATE_ADDR_CYCLE_INTERVAL_S;
    privacy_params.p_device_irk         = NULL;

    // Set privacy.
    err_code = sd_ble_gap_privacy_set(&privacy_params);
    APP_ERROR_CHECK(err_code);
}


static void cmd_numeric(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s\n", UNKNOWN_PARAMETER, argv[1]);
}


/**@brief Command handler for accepting a numeric value.
 */
static void cmd_numeric_accept(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argc);
    UNUSED_VARIABLE(argv);

    ret_code_t err_code;

    if (is_numeric_match_requested())
    {
        // If numeric match request and keys on the both devices are the same then accept.
        err_code = sd_ble_gap_auth_key_reply(numeric_match_request_conn_handle_get(),
                                             BLE_GAP_AUTH_KEY_TYPE_PASSKEY, NULL); // Accept
        APP_ERROR_CHECK(err_code);

        // Clear numeric match flag.
        numeric_match_request_clear();
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Numeric Match\n");
    }
    else
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "This command can be used only with numeric comparison pairing\n");
    }
}


/**@brief Command handler for rejecting a numeric value.
 */
static void cmd_numeric_reject(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argc);
    UNUSED_VARIABLE(argv);

    ret_code_t err_code;

    if (is_numeric_match_requested())
    {
        // If numeric match request and keys on both devices are not the same, then reject.
        err_code = sd_ble_gap_auth_key_reply(numeric_match_request_conn_handle_get(),
                                             BLE_GAP_AUTH_KEY_TYPE_NONE, NULL); // Reject
        APP_ERROR_CHECK(err_code);

        // Clear a numeric match flag.
        numeric_match_request_clear();
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Numeric Reject\n");
    }
    else
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "This command can be used only with numeric comparison pairing\n");
    }
}


#if NRF_MODULE_ENABLED(ADAFRUIT_SHIELD)
static void cmd_nfc_reader(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }
    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);
}


/**@brief Command handler for pairing by NFC in central role.
 */
static void cmd_nfc_reader_on(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argv);

    if (argc != 1)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    ret_code_t err_code;

    // In order to avoid a mistake when reusing the command.
    nfc_pair_stop();
    err_code = adafruit_pn532_field_off();
    ret_code_verify(err_code);

    // Turn on the Adafruit tag reader.
    err_code = adafruit_pn532_field_on();
    APP_ERROR_CHECK(err_code);

    nfc_pair_start();
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "NFC reader ON\n");
}


/**@brief Command handler for disabling pairing by NFC in central role.
 */
static void cmd_nfc_reader_off(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argv);

    ret_code_t err_code;

    if (argc != 1)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    nfc_pair_stop();
    err_code = adafruit_pn532_field_off();
    ret_code_verify(err_code);

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "NFC reader OFF\n");
}


#endif // ADAFRUIT_SHIELD

static void cmd_gatt(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);
}



/**@brief Command handler for services discovery.
 */
static void cmd_services_discovery(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    ret_code_t err_code;
    uint16_t   conn_handle;

    // Start handle to look for services.
    uint16_t handle = 0x0001;
    conn_handle = addr_string_to_conn_handle(argv[1]);
    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

