Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
    // Discovery primary services.
    err_code = sd_ble_gattc_primary_services_discover(conn_handle, handle, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Command handler for characteristics discovery.
 */
static void cmd_char_get(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    uint16_t   conn_handle;
    ret_code_t err_code;

    // Search for a connection handle.
    conn_handle = addr_string_to_conn_handle(argv[1]);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    // Look for start handle range.
    ble_gattc_handle_range_t * p_handle_range = handle_range_search(argv[2], conn_handle);

    // Characteristic discovery.
    err_code = sd_ble_gattc_characteristics_discover(conn_handle, p_handle_range);

    if (err_code != NRF_SUCCESS)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "incorrect service UUID or service does not exist\n");
    }
}



/**@brief Command handler for reading a characteristic value.
 */
static void cmd_char_read(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    uint16_t   conn_handle;
    uint16_t   val_handle;
    ret_code_t err_code;

    // Search for a connection handle.
    conn_handle = addr_string_to_conn_handle(argv[1]);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    // Search for a Characterisctic Value Handle.
    val_handle = handle_value_search(argv[2]);
    if (val_handle == BLE_GATT_HANDLE_INVALID)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s%s\n",
                        "The selected service does not contain the characteristic - ",
                        argv[2]);
        return;
    }

    // Read characteristic data.
    err_code = sd_ble_gattc_read(conn_handle, val_handle, 0);
    APP_ERROR_CHECK(err_code);
}


/**@brief Command handler for writing a value to the characteristic.
 */
static void cmd_char_write(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{

    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    uint16_t                 conn_handle;
    ret_code_t               err_code;
    ble_gattc_write_params_t write_params;
    uint8_t                  data_buf[GATT_DATA_WRITE_SIZE];
    uint16_t                 val_handle;

    // Calculate data length, first 4 argv are commands, the rest of argv are data.
    uint16_t data_len = argc - 4;

    memset(&write_params, 0, sizeof(write_params));

    if (!strcmp(argv[1], "command"))
    {
        write_params.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    else if (!strcmp(argv[1], "request"))
    {
        write_params.write_op = BLE_GATT_OP_WRITE_REQ;
    }
    else
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);
        return;
    }

    // Search for a connection handle.
    conn_handle = addr_string_to_conn_handle(argv[2]);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    // Search for a Characteristic Value Handle.
    val_handle = handle_value_search(argv[3]);

    if (val_handle == BLE_GATT_HANDLE_INVALID)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s%s\n",
                        "The selected service does not contain the characteristic - ",
                        argv[3]);
        return;
    }

    write_params.handle  = val_handle;
    write_params.len     = data_len;
    write_params.p_value = data_buf;
    write_params.offset  = 0;
    write_params.flags   = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;

    for (uint8_t i = 0; i < data_len; i++)
    {
        data_buf[i] = atoi(argv[i + 4]);
    }

    // Write data to characteristic.
    err_code = sd_ble_gattc_write(conn_handle, &write_params);
    APP_ERROR_CHECK(err_code);
}


static void cmd_notify(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);
}

/**@brief Command handler for enabling a notification.
 */
static void cmd_notify_on(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argc);

    // In order to enable the notification, the CCCD descriptor should take the value 1.
    cccd_set(p_cli, 0x01, argv[1], argv[2]);
}


/**@brief Command handler for disabling a notification.
 */
static void cmd_notify_off(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argc);
    // In order to disable the notification, the CCCD descriptor should take the value 0.
    cccd_set(p_cli, 0x00, argv[1], argv[2]);
}


static void cmd_ind(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);

}


/**@brief Command handler for enabling an indication.
 */
static void cmd_ind_on(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argc);

    // In order to enable the indication, the CCCD descriptor should take the value 2.
    cccd_set(p_cli, 0x02, argv[1], argv[2]);
}


/**@brief Command handler for disabling an indication.
 */
static void cmd_ind_off(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argc);

    // In order to disable the indication, the CCCD descriptor should take the value 0.
    cccd_set(p_cli, 0x00, argv[1], argv[2]);
}


/**@brief Command handler for setting link layer data length.
 */
static void cmd_data_length_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (argc != 3)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    uint16_t conn_handle;

    for (uint8_t i = 0; i < strlen(argv[2]); i++)
    {
        if (!isdigit((int) argv[2][i]))
        {
            nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "data length must be a number\n");
            return;
        }
    }

