Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
    // Search for connection handle.
    conn_handle = addr_string_to_conn_handle(argv[1]);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    // Set new link layer data length.
    link_layer_data_length_set(argv[2], conn_handle);
}


/**@brief Command handler for setting the PHY to 1 MBPS.
 */
static void cmd_phy_1m_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argc);

    uint16_t conn_handle;

    // Search for a connection handle.
    conn_handle = addr_string_to_conn_handle(argv[1]);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    // PHY value set.
    phy_set(p_cli, BLE_GAP_PHY_1MBPS, conn_handle);
}



/**@brief Command handler for setting the PHY to 2 MBPS.
 */
static void cmd_phy_2m_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argc);

    uint16_t conn_handle;

    // Search for a connection handle.
    conn_handle = addr_string_to_conn_handle(argv[1]);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    // PHY value set.
    phy_set(p_cli, BLE_GAP_PHY_2MBPS, conn_handle);
}


#ifdef NRF52840_XXAA
/**@brief Command handler for setting the PHY to coded.
 */
static void cmd_phy_coded_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    UNUSED_VARIABLE(argc);

    uint16_t conn_handle;

    // Search for a connection handle.
    conn_handle = addr_string_to_conn_handle(argv[1]);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    // PHY value set.
    phy_set(p_cli, BLE_GAP_PHY_CODED, conn_handle);
}


#endif

static void cmd_phy(nrf_cli_t const * p_cli, size_t argc, char * * argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);

}


static void cmd_parameters(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);
}


/**@brief Command handler for setting the MTU.
 */
static void cmd_mtu_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    for (uint8_t i = 0; i < strlen(argv[1]); i++)
    {
        if (!isdigit((int) argv[1][i]))
        {
            nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "MTU must be a number\n");
            return;
        }
    }

    // Set a new MTU value.
    gatt_mtu_set(argv[1]);
}


/**@brief Command handler for setting the Minimum Connection Interval.
 */
static void cmd_min_conn_interval_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    uint16_t value;

    if (argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    for (uint8_t i = 0; i < strlen(argv[1]); i++)
    {
        if (!isdigit((int) argv[1][i]))
        {
            nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "min_conn_interval must be a number\n");
            return;
        }
    }

    value = (uint16_t)MSEC_TO_UNITS(atoi(argv[1]), UNIT_1_25_MS);

    // Checking the value is within the required range.
    if ((value < MSEC_TO_UNITS(BLE_GAP_CP_MIN_CONN_INTVL_MIN, UNIT_1_25_MS)) || 
        (value > MSEC_TO_UNITS(BLE_GAP_CP_MIN_CONN_INTVL_MAX, UNIT_1_25_MS)))
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s %d and %d.\n",
                        "Minimum connection interval must be between",
                        BLE_GAP_CP_MIN_CONN_INTVL_MIN,
                        BLE_GAP_CP_MIN_CONN_INTVL_MAX);
        return;
    }

    m_params_update.min_conn_interval = value;
}


/**@brief Command handler for setting Maximum Connection Interval.
 */
static void cmd_max_conn_interval_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    uint16_t value;

    if (argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    for (uint8_t i = 0; i < strlen(argv[1]); i++)
    {
        if (!isdigit((int) argv[1][i]))
        {
            nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "max_conn_interval must be a number.\n");
            return;
        }
    }

    value = (uint16_t)MSEC_TO_UNITS(atoi(argv[1]), UNIT_1_25_MS);

    // Checking whether the value is within the required range.
    if ((value < MSEC_TO_UNITS(BLE_GAP_CP_MAX_CONN_INTVL_MIN, UNIT_1_25_MS)) || 
        (value > MSEC_TO_UNITS(BLE_GAP_CP_MAX_CONN_INTVL_MAX, UNIT_1_25_MS)))
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s %d and %d.\n",
                        "Maximum connection interval must be between",
                        BLE_GAP_CP_MAX_CONN_INTVL_MIN,
                        BLE_GAP_CP_MAX_CONN_INTVL_MAX);
        return;
    }

    m_params_update.max_conn_interval = value;
}


/**@brief Command handler for setting Slave Latency.
 */
static void cmd_slave_latency_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    uint16_t value;

    if (argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    for (uint8_t i = 0; i < strlen(argv[1]); i++)
    {
        if (!isdigit((int) argv[1][i]))
        {
            nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Slave latency must be a number\n");
            return;
        }
    }

    value = atoi(argv[1]);

    if (value > BLE_GAP_CP_SLAVE_LATENCY_MAX)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s%d.\n",
                        "Slave latency should be less than: ",
                        BLE_GAP_CP_SLAVE_LATENCY_MAX);
        return;
    }

    m_params_update.slave_latency = value;
}


/**@brief Command handler for setting Supervisory time-out.
 */
static void cmd_sup_timeout_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    uint16_t value;
    uint16_t check;
    uint16_t valid;

    if (argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    for (uint8_t i = 0; i < strlen(argv[1]); i++)
    {
        if (!isdigit((int) argv[1][i]))
        {
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_ERROR,
                            "Supervision time-out must be a number.\n");
            return;
        }
    }

    check = atoi(argv[1]);
    value = (uint16_t)MSEC_TO_UNITS(check, UNIT_10_MS);
    valid = (1 + m_params_update.slave_latency) * UNIT_TO_MSEC(m_params_update.max_conn_interval,
                                                               UNIT_1_25_MS) * 2;
    // Checking whether the value is within the required range.
    if ((value < MSEC_TO_UNITS(BLE_GAP_CP_CONN_SUP_TIMEOUT_MIN, UNIT_10_MS)) ||
        (value > MSEC_TO_UNITS(BLE_GAP_CP_CONN_SUP_TIMEOUT_MAX, UNIT_10_MS)))
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s  %d and %d.\n",
                        "Supervision time-out must be between",
                        BLE_GAP_CP_CONN_SUP_TIMEOUT_MIN,
                        BLE_GAP_CP_CONN_SUP_TIMEOUT_MAX);
        return;
    }

    if (check <= valid)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s \n%s%d\n",
                        "Supervision_Timeout in milliseconds shall be larger than:",
                        "(1 + Slave_Latency) * Conn_Interval_Max * 2 - ",
                        valid);
        return;
    }

