Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
    m_params_update.conn_sup_timeout = value;
}


/**@brief Command handler for setting connection parameters.
 */
static void cmd_connection_params_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    ret_code_t err_code;
    uint16_t   conn_handle;

    // Search for a connection handle.
    conn_handle = addr_string_to_conn_handle(argv[1]);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    // Set connection parameters for the connection.
    err_code = sd_ble_gap_conn_param_update(conn_handle, &m_params_update);

    if (err_code == NRF_SUCCESS)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_NORMAL,
                        "Preferred connection parameters changed successfully\n");

        default_con_param(&m_params_update);
    }
    else
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "Connection parameters could not be changed\n");
    }
}


/**@brief Command handler for displaying connectable devices.
 */
static void cmd_devices_display(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (argc >= 2)
    {
        if (nrf_cli_help_requested(p_cli))
        {
            nrf_cli_help_print(p_cli, NULL, 0);
            return;
        }
        else
        {
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_ERROR,
                            "%s:%s%s\n",
                            argv[0],
                            " bad parameter ",
                            argv[1]);
            return;
        }
    }

    // Print connectable devices from scan data.
    scanned_device_t * p_device_list = scan_device_info_get();
    device_list_print(p_cli, p_device_list);
}


static void cmd_remove(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);
}


/**@brief Command handler for displaying bonded devices.
 */
static void cmd_bonded_devices_display(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (argc > 1)
    {
        if (nrf_cli_help_requested(p_cli))
        {
            nrf_cli_help_print(p_cli, NULL, 0);
            return;
        }

        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Peers count: %d \n", pm_peer_count());

    pm_peer_id_t current_peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);

    // Display all bonded devices.
    while (current_peer_id != PM_PEER_ID_INVALID)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "ID: %d  address: ", current_peer_id);

        ret_code_t             err_code;
        pm_peer_data_bonding_t data;
        char                   string_addr_buf[ADDR_STRING_LEN];

        // Get bonding data.
        err_code = pm_peer_data_bonding_load(current_peer_id, &data);
        APP_ERROR_CHECK(err_code);
        current_peer_id = pm_next_peer_id_get(current_peer_id);

        // Convert device address to string.
        int_addr_to_hex_str(string_addr_buf,
                            BLE_GAP_ADDR_LEN,
                            data.peer_ble_id.id_addr_info.addr);

        // Display bonded device.
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "%s\n", string_addr_buf);
    }
}


/**@brief Command handler for pairing with a device.
 */
static void cmd_device_pair(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (!strcmp(argv[1], "LESC"))
    {
        m_sec_params_central.lesc = 1;
    }
    else if (!strcmp(argv[1], "LEGACY"))
    {
        m_sec_params_central.lesc = 0;
    }
    else
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s:%s%s\n", argv[0], " wrong command ", argv[1]);
        return;
    }

    ret_code_t err_code;

    // Search for connection handle.
    m_conn_handle = addr_string_to_conn_handle(argv[2]);

    if(!conn_handle_is_valid(m_conn_handle, p_cli))
    {
        return;
    }

    if (!strcmp(argv[3], "mitm"))
    {
        m_sec_params_central.mitm    = 1;
        m_sec_params_central.io_caps = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
    }
    else
    {
        m_sec_params_central.mitm    = 0;
        m_sec_params_central.io_caps = BLE_GAP_IO_CAPS_NONE;
    }

    if (!strcmp(argv[3], "oob"))
    {
        m_sec_params_central.mitm    = 1;
        m_sec_params_central.oob     = 1;
        m_sec_params_central.io_caps = BLE_GAP_IO_CAPS_NONE;
    }

    // Based on command parameters, set security parameters.
    err_code = pm_sec_params_set(&m_sec_params_central);
    APP_ERROR_CHECK(err_code);

    // Establishing encryption on a connection, and optionally establishing a bond.
    err_code = pm_conn_secure(m_conn_handle, false);

    if (err_code != NRF_SUCCESS)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "Device is not connected or is already paired\n");
    }
    else
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Start pairing\n");
    }
}


/**@brief Command handler for reply to BLE_GAP_EVT_AUTH_KEY_REQUEST.
 */
static void cmd_key_reply(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (!m_key_request_event)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "No key request\n");
        return;
    }

    if (strlen(argv[1]) != KEY_PASSKEY_LEN)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s", "invalid key length!\n");
        return;
    }

    ret_code_t err_code;
    uint8_t    key[KEY_PASSKEY_LEN];

    for (uint8_t i = 0; i < KEY_PASSKEY_LEN; i++)
    {
        if (!isdigit((int) argv[1][i]))
        {
            nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "the key must consist of digits\n");
            return;
        }

        key[i] = argv[1][i];
    }

    // Reply with an authentication key. 
    err_code = sd_ble_gap_auth_key_reply(m_conn_handle,
                                         BLE_GAP_AUTH_KEY_TYPE_PASSKEY,
                                         key);
    m_key_request_event = false;

    if (err_code != NRF_SUCCESS)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Error sending key\n");
    }
    else
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Key sending success\n");
    }
}


