Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
/**@brief Command handler for setting a device name.
 */
static void cmd_device_name_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    ret_code_t              err_code;
    ble_gap_conn_sec_mode_t sec_mode;
    char                    buf[DEVICE_NAME_MAX_SIZE];

    memset(buf, 0, DEVICE_NAME_MAX_SIZE);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    for (uint8_t i = 1; i < argc; i++)
    {
        strcat(buf, argv[i]);

        if (i == (argc - 1))
        {
            break;
        }

        strcat(buf, " ");
    }

    // Set new device name.
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)buf,
                                          strlen(buf));

    //Re-initialization of advertising with new device name.
    advertising_init();
    APP_ERROR_CHECK(err_code);
}

//Beacon Start.
static void cmd_beacon_start()
{
    

}

static void cmd_beacon_uuid(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if(argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    if(strlen(argv[1])!=16)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    adv_stop();

    char  buf[17];

    memset(buf, 0, 17);

    for (uint8_t i = 1; i < argc; i++)
    {
        strcat(buf, argv[i]);

        if (i == (argc - 1))
        {
            break;
        }

        strcat(buf, " ");
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, buf);

    for(uint8_t i=0; i<strlen(argv[1]); i++)
    {
        m_beacon_info[i+2] = buf[i];
        
    }

    //Go to ADV function.
}

static void cmd_beacon_major(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if(argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    if(strlen(argv[1])!=4)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    adv_stop();

    char  buf[5];

    memset(buf, 0, 5);

    for (uint8_t i = 1; i < argc; i++)
    {
        strcat(buf, argv[i]);

        if (i == (argc - 1))
        {
            break;
        }

        strcat(buf, " ");
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, buf);

    for(uint8_t i=0; i<strlen(argv[1]); i++)
    {
        m_beacon_info[i+18] = buf[i];
        
    }

    //Go to ADV function.
}

static void cmd_beacon_minor(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if(argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    if(strlen(argv[1])!=4)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    adv_stop();

    char  buf[5];

    memset(buf, 0, 5);

    for (uint8_t i = 1; i < argc; i++)
    {
        strcat(buf, argv[i]);

        if (i == (argc - 1))
        {
            break;
        }

        strcat(buf, " ");
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, buf);

    for(uint8_t i=0; i<strlen(argv[1]); i++)
    {
        m_beacon_info[i+22] = buf[i];
        
    }

    //Go to ADV function.
}

static void cmd_beacon_txpower(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if(argc != 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    if(strlen(argv[1])!=2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    adv_stop();

    char  buf[3];

    memset(buf, 0, 3);

    for (uint8_t i = 1; i < argc; i++)
    {
        strcat(buf, argv[i]);

        if (i == (argc - 1))
        {
            break;
        }

        strcat(buf, " ");
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, buf);

    for(uint8_t i=0; i<strlen(argv[1]); i++)
    {
        m_beacon_info[i+26] = buf[i];
        
    }

    //Go to ADV function.
}


static void cmd_set_beacon_data(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);
}

/**@brief Command handler for enabling advertising.
 */
static void cmd_advertise_on(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t err_code;

    if (argc > 1)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    adv_stop();
    err_code = nfc_ble_pair_stop();
    ret_code_verify(err_code);
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Advertising enabled\n");
    adv_start();
    err_code = nfc_ble_pair_start();
    APP_ERROR_CHECK(err_code);
}


/**@brief Command handler for disabling advertising.
 */
static void cmd_advertise_off(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    ret_code_t err_code;

    if (argc > 1)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
        return;
    }

    adv_stop();
    err_code = nfc_ble_pair_stop();
    ret_code_verify(err_code);
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Advertising disabled\n");
}


static void cmd_advertise(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);
}


/**@brief Command handler for disabling scanning.
 */
static void cmd_scan_off(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (argc != 1)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s %s: %s",
                        argv[-1],
                        argv[0],
                        WRONG_PARAMETER_COUNT);
        return;
    }

    scan_stop();
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Scan stopped\n");
}


/**@brief Command handler for enabling scanning.
 */
static void cmd_scan_on(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (argc != 1)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s %s: %s",
                        argv[-1],
                        argv[0],
                        WRONG_PARAMETER_COUNT);
        return;
    }

    scan_start();
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Scan started\n");
}


static void cmd_scan(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

