Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s%s\n",
                        UNKNOWN_PARAMETER,
                        argv[1]);
}


/**@brief Command handler for establishing a connection.
 */
static void cmd_device_connect(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc == 2)
    {
        //Connect by peer ID if davice was bonded and using privacy.
        if (strlen(argv[1]) < (ADDR_STRING_LEN - 1))
        {
            uint16_t pm_id;
            pm_id = atoi(argv[1]);
            private_connect(&pm_id);
            return;
        }

        // If address or peer ID have incorrect format, then return.
        if (strlen(argv[1]) != (ADDR_STRING_LEN - 1))
        {
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_ERROR,
                            "wrong address length - Correct format: XX:XX:XX:XX:XX:XX\n");
            return;
        }

        //Connect by device address.
        addr_store_value_set(argv[1]);
    }
    else
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, WRONG_PARAMETER_COUNT);
    }
}


/**@brief Command handler for disconnecting from a device.
 */
static void cmd_device_disconnect(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: %s", argv[0], WRONG_PARAMETER_COUNT);
        return;
    }

    if (strlen(argv[1]) != (ADDR_STRING_LEN - 1))
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "wrong address length - Correct format: XX:XX:XX:XX:XX:XX\n");
        return;
    }

    uint16_t   conn_handle;
    ret_code_t err_code;

    // Search for a connection handle.
    conn_handle = addr_string_to_conn_handle(argv[1]);

    if(!conn_handle_is_valid(conn_handle, p_cli))
    {
        return;
    }

    // Disconnect from a device.
    err_code = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    ret_code_verify(err_code);
}


static void cmd_all_bonds_delete(nrf_cli_t const * p_cli, size_t argc, char * * argv)
{
	if (argc == 1)
	{
	    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Bonding data deleted\n");
	    bonds_delete();
	    return;
	}

	if (nrf_cli_help_requested(p_cli))
	{
	    nrf_cli_help_print(p_cli, NULL, 0);
	    return;
	}

	nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s%s\n", UNKNOWN_PARAMETER, argv[1]);
}


/**@brief Command handler for removing device bonding data.
 */
static void cmd_device_remove(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    ret_code_t   err_code;
    pm_peer_id_t current_peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);

    // Search for device bondind data.
    while (current_peer_id != PM_PEER_ID_INVALID)
    {
        pm_peer_data_bonding_t p_data;

        err_code = pm_peer_data_bonding_load(current_peer_id, &p_data);
        APP_ERROR_CHECK(err_code);

        if (is_address_compare(&p_data.peer_ble_id.id_addr_info, argv[1]))
        {
            // If bonding data was found, then remove.
            err_code = pm_peer_delete(current_peer_id);
            APP_ERROR_CHECK(err_code);

            // Remove device from bonded device command buffer.
            cli_addr_from_command_remove(argv[1],
                                         &m_cli_bonded,
                                         CLI_CMD_BONDED);
        }

        current_peer_id = pm_next_peer_id_get(current_peer_id);
    }
}


/* Dynamic command creation */
static void connected_get(size_t idx, nrf_cli_static_entry_t * p_static)
{
    // Must be sorted alphabetically to ensure correct CLI completion.
    p_static->p_syntax = (idx < m_cli_connected.cmd_counter) ?
                         m_cli_connected.buffer_type.connected_cmd_buffer[idx] : NULL;
    p_static->handler  = NULL;
    p_static->p_subcmd = NULL;
    p_static->p_help   = 0;
}


/* Dynamic command creation */
static void connect_addr_get(size_t idx, nrf_cli_static_entry_t * p_static)
{
    // Must be sorted alphabetically to ensure correct CLI completion.
    p_static->p_syntax = (idx < m_cli_connect_addr.cmd_counter) ?
                         m_cli_connect_addr.buffer_type.connect_addr_cmd_buffer[idx] : NULL;
    p_static->handler  = NULL;
    p_static->p_subcmd = NULL;
    p_static->p_help   = "Connect with address.";
}


/* Dynamic command creation */
static void delete_bond_get(size_t idx, nrf_cli_static_entry_t * p_static)
{
    // Must be sorted alphabetically to ensure correct CLI completion.
    p_static->p_syntax = (idx < m_cli_bonded.cmd_counter) ?
                         m_cli_bonded.buffer_type.bond_cmd_buffer[idx] : NULL;
    p_static->handler  = NULL;
    p_static->p_subcmd = NULL;
    p_static->p_help   = "Delete device bond by address.";
}

#ifdef CONN_EN
/* Creating subcommands (level 1) for command "LESC and Legacy */
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_pairing_opt)
{
    NRF_CLI_CMD(mitm, NULL, "MITM protection", NULL),
    NRF_CLI_CMD(oob, NULL, "OOB pair mode", NULL),
    NRF_CLI_SUBCMD_SET_END
};


/* Dynamic command creation */
static void pairing_get(size_t idx, nrf_cli_static_entry_t * p_static)
{
    // Must be sorted alphabetically to ensure correct CLI completion.
    p_static->p_syntax = (idx < m_cli_connected.cmd_counter) ?
                         m_cli_connected.buffer_type.connected_cmd_buffer[idx] : NULL;
    p_static->handler  = NULL;
    p_static->p_subcmd = &m_sub_pairing_opt;
    p_static->p_help   = NULL;
}

/* Creating dynamic subcommands (level 2) */
NRF_CLI_CREATE_DYNAMIC_CMD(m_sub_connect_addr_collection, connect_addr_get);
NRF_CLI_CREATE_DYNAMIC_CMD(m_sub_pairing_set, pairing_get);

/* Creating dynamic subcommands (level 1) */
NRF_CLI_CREATE_DYNAMIC_CMD(m_sub_connected_collection, connected_get);
NRF_CLI_CREATE_DYNAMIC_CMD(m_sub_delete_bond_collection, delete_bond_get);

/* Creating subcommands (level 2) for command "phy" */
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_phy)
{
    NRF_CLI_CMD(1M,
                &m_sub_connected_collection,
                "Set preferred PHY to 1 Mbps.",
                cmd_phy_1m_set),
    NRF_CLI_CMD(2M,
                &m_sub_connected_collection,
                "Set preferred PHY to 2 Mbps.",
                cmd_phy_2m_set),
#ifdef NRF52840_XXAA
    NRF_CLI_CMD(coded,
                &m_sub_connected_collection,
                "Set preferred PHY to Coded.",
                cmd_phy_coded_set),
#endif
    NRF_CLI_SUBCMD_SET_END
};

/* Creating subcommands (level 2)*/
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_write)
{
    NRF_CLI_CMD(command,
                &m_sub_connected_collection,
                "<char_uuid> <value> Write characteristic value(request).",
                NULL),
    NRF_CLI_CMD(request,
                &m_sub_connected_collection,
                "<char_uuid> <value> Write characteristic value(command).",
                NULL),
    NRF_CLI_SUBCMD_SET_END
};

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_notify)
{
    NRF_CLI_CMD(off, &m_sub_connected_collection, "Notifications off.", cmd_notify_off),
    NRF_CLI_CMD(on, &m_sub_connected_collection, "Notifications on.", cmd_notify_on),
    NRF_CLI_SUBCMD_SET_END
};

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_ind)
{
    NRF_CLI_CMD(off, &m_sub_connected_collection, "Indications off.", cmd_ind_off),
    NRF_CLI_CMD(on, &m_sub_connected_collection, "Indications on.", cmd_ind_on),
    NRF_CLI_SUBCMD_SET_END
};
#endif

/* Creating subcommands (level 1)*/
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_privacy)
{
    NRF_CLI_CMD(off, NULL, "Privacy advertising mode off.", cmd_privacy_off),
    NRF_CLI_CMD(on, NULL, "Privacy advertising mode on.", cmd_privacy_on),
    NRF_CLI_SUBCMD_SET_END
};
#ifdef CONN_EN
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_numeric)
{
    NRF_CLI_CMD(accept, NULL, "Accepts pin value.", cmd_numeric_accept),
    NRF_CLI_CMD(reject, NULL, "Reject pin value.", cmd_numeric_reject),
    NRF_CLI_SUBCMD_SET_END
};
#endif

