Defklol/Have_Conn_Beacon/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/YMC788/cli_m.c
#if NRF_MODULE_ENABLED(ADAFRUIT_SHIELD)
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_nfc_reader)
{
    NRF_CLI_CMD(off, NULL, "NFC reader off.", cmd_nfc_reader_off),
    NRF_CLI_CMD(on, NULL, "NFC reader on.", cmd_nfc_reader_on),
    NRF_CLI_SUBCMD_SET_END
};
#endif // ADAFRUIT_SHIELD
#ifdef CONN_EN
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_gatt)
{
    NRF_CLI_CMD(characteristics,
                &m_sub_connected_collection,
                "<address> <serv_uuid> Get information about the contents of a service.",
                cmd_char_get),
    NRF_CLI_CMD(indication,
                &m_sub_ind,
                "<sub_cmd> <address> <char_uuid> Change indication state.",
                cmd_ind),
    NRF_CLI_CMD(notification,
                &m_sub_notify,
                "<sub_cmd> <address> <char_uuid> Change notification state.",
                cmd_notify),
    NRF_CLI_CMD(read,
                &m_sub_connected_collection,
                "<address> <char_uuid> Read characteristic value.",
                cmd_char_read),
    NRF_CLI_CMD(services,
                &m_sub_connected_collection,
                "<address> Download list of services.",
                cmd_services_discovery),
    NRF_CLI_CMD(write,
                &m_sub_write,
                "<sub_cmd> <address> <char_uuid> <value> Write characteristic value.",
                cmd_char_write),
    NRF_CLI_SUBCMD_SET_END
};

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_parameters)
{
    NRF_CLI_CMD(apply,
                &m_sub_connected_collection,
                "<address> Change connection parameters for the device.",
                cmd_connection_params_set),
    NRF_CLI_CMD(data_length,
                &m_sub_connected_collection,
                "<address> <value> Data length change.",
                cmd_data_length_set),
    NRF_CLI_CMD(max_conn_interval,
                NULL,
                "<value> Set maximum connection interval.",
                cmd_max_conn_interval_set),
    NRF_CLI_CMD(min_conn_interval,
                NULL,
                "<value> Set minimum connection interval.",
                cmd_min_conn_interval_set),
    NRF_CLI_CMD(mtu, NULL, "<value> Change MTU value.", cmd_mtu_set),
    NRF_CLI_CMD(phy, &m_sub_phy, "<subcmd> <address> PHY change.  ", cmd_phy),
    NRF_CLI_CMD(slave_latency, NULL, "<value> Set slave latency.", cmd_slave_latency_set),
    NRF_CLI_CMD(sup_timeout, NULL, "<value> Set connection supervision time-out.", cmd_sup_timeout_set),
    NRF_CLI_SUBCMD_SET_END
};
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_remove)
{
    NRF_CLI_CMD(all, NULL, "Remove all bonded devices.", cmd_all_bonds_delete),
    NRF_CLI_CMD(device,
                &m_sub_delete_bond_collection,
                "<address> Remove one bonded device.",
                cmd_device_remove),
    NRF_CLI_SUBCMD_SET_END
};
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_pairing)
{
    NRF_CLI_CMD(LEGACY, &m_sub_pairing_set, "Legacy pairing mode.", NULL),
    NRF_CLI_CMD(LESC, &m_sub_pairing_set, "LESC pairing mode.", NULL),
    NRF_CLI_SUBCMD_SET_END
};
#endif
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_advertise)
{
    NRF_CLI_CMD(off, NULL, "Advertising off.", cmd_advertise_off),
    NRF_CLI_CMD(on, NULL, "Advertising on.", cmd_advertise_on),
	NRF_CLI_SUBCMD_SET_END
};

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_scan)
{
    NRF_CLI_CMD(off, NULL, "Stop scanning.", cmd_scan_off),
    NRF_CLI_CMD(on, NULL, "Start scanning.", cmd_scan_on),
    NRF_CLI_SUBCMD_SET_END
};

/* Dynamic command creation */
static void beacon_uuid_get(size_t idx, nrf_cli_static_entry_t * p_static)
{
    // Must be sorted alphabetically to ensure correct CLI completion.
    p_static->p_syntax = (idx < m_cli_uuid.cmd_counter) ?
                         m_cli_uuid.buffer_type.beacon_uuid_cmd_buffer[idx] : NULL;
    p_static->handler  = NULL;
    p_static->p_subcmd = NULL;
    p_static->p_help   = "Set beacon UUID.";
}

/* Dynamic command creation */
static void beacon_major_get(size_t idx, nrf_cli_static_entry_t * p_static)
{
    // Must be sorted alphabetically to ensure correct CLI completion.
    p_static->p_syntax = (idx < m_cli_major.cmd_counter) ?
                         m_cli_major.buffer_type.beacon_major_cmd_buffer[idx] : NULL;
    p_static->handler  = NULL;
    p_static->p_subcmd = NULL;
    p_static->p_help   = "Set beacon MAJOR.";
}

/* Dynamic command creation */
static void beacon_minor_get(size_t idx, nrf_cli_static_entry_t * p_static)
{
    // Must be sorted alphabetically to ensure correct CLI completion.
    p_static->p_syntax = (idx < m_cli_minor.cmd_counter) ?
                         m_cli_minor.buffer_type.beacon_minor_cmd_buffer[idx] : NULL;
    p_static->handler  = NULL;
    p_static->p_subcmd = NULL;
    p_static->p_help   = "Set beacon MINOR.";
}

/* Dynamic command creation */
static void beacon_txpower_get(size_t idx, nrf_cli_static_entry_t * p_static)
{
    // Must be sorted alphabetically to ensure correct CLI completion.
    p_static->p_syntax = (idx < m_cli_txpower.cmd_counter) ?
                         m_cli_txpower.buffer_type.beacon_txpower_cmd_buffer[idx] : NULL;
    p_static->handler  = NULL;
    p_static->p_subcmd = NULL;
    p_static->p_help   = "Set beacon TXPower.";
}

NRF_CLI_CREATE_DYNAMIC_CMD(m_sub_uuid_set, beacon_uuid_get);
NRF_CLI_CREATE_DYNAMIC_CMD(m_sub_major_set, beacon_major_get);
NRF_CLI_CREATE_DYNAMIC_CMD(m_sub_minor_set, beacon_minor_get);
NRF_CLI_CREATE_DYNAMIC_CMD(m_sub_txpower_set, beacon_txpower_get);

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_beacon)
{
    NRF_CLI_CMD(uuid, &m_sub_uuid_set, "Set 16 bytes UUID.", cmd_beacon_uuid),
    NRF_CLI_CMD(major, &m_sub_major_set, "Set 4 bytes MAJOR.", cmd_beacon_major),
    NRF_CLI_CMD(minor, &m_sub_minor_set, "Set 4 bytes MINOR.", cmd_beacon_minor),
    NRF_CLI_CMD(txpower, &m_sub_txpower_set, "Set 2 bytes Tx Power.", cmd_beacon_txpower),
    NRF_CLI_SUBCMD_SET_END
};

/* Creating root (level 0) command */
#ifdef CONN_EN
NRF_CLI_CMD_REGISTER(connected_devices,
                     NULL,
                     "Display connected devices and information about security level.",
                     cmd_connected_display);
#endif
NRF_CLI_CMD_REGISTER(privacy, &m_sub_privacy, "Set privacy settings.", cmd_privacy);
#ifdef CONN_EN
NRF_CLI_CMD_REGISTER(numeric,
                     &m_sub_numeric,
                     "Confirm or reject the value of the pin code.",
                     cmd_numeric);
#endif
#if NRF_MODULE_ENABLED(ADAFRUIT_SHIELD)
NRF_CLI_CMD_REGISTER(nfc_read,
                     &m_sub_nfc_reader,
                     "Turn on NFC for reading <on/off>.",
                     cmd_nfc_reader);
#endif // ADAFRUIT_SHIELD
#ifdef CONN_EN
NRF_CLI_CMD_REGISTER(gatt, &m_sub_gatt, "Gatt options.", cmd_gatt);

NRF_CLI_CMD_REGISTER(parameters,
                     &m_sub_parameters,
                     "<subcmd> Change connection and link layer parameters.",
                     cmd_parameters);

NRF_CLI_CMD_REGISTER(bonded_devices, 
                     NULL,
                     "List bonded devices (The devices are identified by public address).",
                     cmd_bonded_devices_display);
#endif
NRF_CLI_CMD_REGISTER(devices, NULL, "List available devices.", cmd_devices_display);
#ifdef CONN_EN
NRF_CLI_CMD_REGISTER(remove_bond, &m_sub_remove, "<subcmd> Remove bonded device.", cmd_remove);
NRF_CLI_CMD_REGISTER(key_reply, NULL, "<key> Enter key from another device.", cmd_key_reply);
NRF_CLI_CMD_REGISTER(pair,
                     &m_sub_pairing,
                     "<subcmd> <address> <option> Start pairing with a evice.",
                     cmd_device_pair);
#endif
NRF_CLI_CMD_REGISTER(device_name, NULL, "<name> Set device name.", cmd_device_name_set);
NRF_CLI_CMD_REGISTER(advertise , &m_sub_advertise, "Turn advertising <on/off>.", cmd_advertise);
NRF_CLI_CMD_REGISTER(scan, &m_sub_scan, "Scan options", cmd_scan);
#ifdef CONN_EN
NRF_CLI_CMD_REGISTER(connect,
                     &m_sub_connect_addr_collection,
                     "<address/peer_id> Connect with a device.",
                     cmd_device_connect);
NRF_CLI_CMD_REGISTER(disconnect,
                     &m_sub_connected_collection,
                     "<address> Disconnect from a device.",
                     cmd_device_disconnect);
#endif
NRF_CLI_CMD_REGISTER(set_beacon_data, &m_sub_beacon, "Set Beacon data.<UUID> 16 bytes.<Major> 4 bytes.<Minor> 4 bytes.<TxPower> 2 bytes.", cmd_set_beacon_data);
